Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཕ་རོལ་དུ་ཕྱིན་པར་འགྱུར་བས། དེའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིས། ཆོས་ཐམས་ཅད་ཀྱི་མཆོག་གི་ཚུལ་ཕྱེད་དེ། ཆོས་དེ་དག་ཀུན་ལ་ཡང་འཁོར་བ་མ་དམིགས་པས་དེའི་ཕྱིར།
en: Moreover, Subhūti, it is through this perfection of wisdom that the supreme principle (paramārtha) of all phenomena is distinguished, for in all phenomena no cyclic existence at all is apprehended; that, too, is why one speaks of the ‘perfection of wisdom.’

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིར། དེ་བཞིན་ཉིད་ཀྱང་ཆུད་ཡང་དག་པའི་མཐའ་ཡང་ཆུད། ཆོས་ཀྱི་དབྱིངས་ཀྱང་ཆུད་དེ། དེའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: Moreover, Subhūti, in this perfection of wisdom the real nature is also included, the very limit of reality is also included, and the realm of phenomena is also included, and so this, too, is why one speaks of the ‘perfection of wisdom.’ “

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཆོས་གང་གིས་ཀྱང་ལྡན་པ་འམ་མི་ལྡན་པ་འམ། བསྟན་དུ་ཡོད་པ་འམ། བསྟན་དུ་མེད་པ་འམ། ཐོགས་པ་དང་བཅས་པ་འམ།
en: Moreover, Subhūti, this perfection of wisdom is not conjoined with anything at all, nor is it disjoined.

source: ཐོགས་པ་མེད་པ་མ་ཡིན་ཏེ།
en: It is neither visible nor invisible, neither impeded nor unimpeded.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི། གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ། མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པའོ།
en: If you ask why, it is because this perfection of wisdom is formless, invisible, and its sole defining characteristic is that it is without defining characteristics.

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྤོབས་པ་ཐམས་ཅད་དང་། སྣང་བ་ཐམས་ཅད་སྐྱེད་པ་སྟེ།
en: Moreover, Subhūti, this perfection of wisdom gives rise to the entirety of inspired speech and the entirety of illumination with respect to all phenomena.

source: རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བདུད་དམ། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་སམ། གང་ཟག་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་ནས།
en: Subhūti, this perfection of wisdom is unbroken and uncaptivated by Māra, by the gods of Māra’s realm, or by individual persons—from followers of the vehicles of the śrāvakas and pratyekabuddhas {Ki.

source: མུ་སྟེགས་ཅན་གཞན་གྱི་བར་དང་། སྡིག་པའི་གྲོགས་པོ་རྣམས་ཀྱིས་མི་ཕྱེད་མི་འཕྲོགས་པ་སྟེ།
en: V: 128} to those who follow rival tīrthikas—or by evil associates.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་གཅད་པར་མི་ནུས་སོ།
en: These cannot interrupt this perfection of wisdom that bodhisattva great beings have.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་དེ་དག་ཐམས་ཅད་དམིགས་སུ་མེད་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because all these are not apprehensible in this perfection of wisdom, owing to the emptiness of intrinsic defining characteristics.

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་དོན་ལ་སྤྱད་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should engage with the meaning of this perfection of wisdom in that manner. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདིའི་དོན་ལ་སྤྱོད་པས། མི་རྟག་པའི་དོན་ལ་སྤྱད་པར་བྱའོ། །སྡུག་བསྔལ་གྱི་དོན་ལ་སྤྱད་པར་བྱའོ། །བདག་མེད་པའི་དོན་ལ་སྤྱད་པར་བྱའོ། །སྡུག་བསྔལ་ཤེས་པའི་དོན་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, by engaging with the meaning of this profound perfection of wisdom, bodhisattva great beings should engage with the meaning of impermanence, they should engage with the meaning of suffering, they should engage with the meaning of nonself, and they should engage with the meaning of the knowledge of suffering.

source: །ཀུན་འབྱུང་བ་ཤེས་པའི་དོན་དང་། འགོག་པ་ཤེས་པའི་དོན་དང་། ལམ་ཤེས་པའི་དོན་ལ་སྤྱད་པར་བྱའོ། །ཟད་པ་ཤེས་པའི་དོན་དང་། མི་སྐྱེ་བ་ཤེས་པའི་དོན་དང་།
en: They should engage with the meaning of the knowledge of the origin [of suffering], the meaning of the knowledge of the cessation [of suffering], and the meaning of knowledge of the path.

source: ཆོས་ཤེས་པའི་དོན་དང་། རྗེས་སུ་འགྲོ་བ་ཤེས་པའི་དོན་དང་། ཀུན་རྫོབ་ཤེས་པའི་དོན་དང་། ཡོངས་སུ་རྟོག་པ་ཤེས་པའི་དོན་དང་། སྒྲ་ཇི་བཞིན་ཤེས་པའི་དོན་ལ་སྤྱད་པར་བྱའོ།
en: They should engage with the meaning of the knowledge that [contaminants] have ended, the meaning of the knowledge that they will not recur, the meaning of the knowledge of phenomena, the meaning of subsequent knowledge, the meaning of the knowledge of the relative, the meaning of the knowledge that is masterful, and the meaning of the knowledge that is semantic.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་དོན་ལ་སྤྱད་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should engage with the meaning of the perfection of wisdom in that manner.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་དོན་དང་དོན་མ་ལགས་པ་མི་དམིགས་ན། འོ་ན་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདིའི་དོན་ལ་སྤྱད་པར་བགྱི།
en: Blessed Lord, if meaning and nonmeaning are not apprehended in this profound perfection of wisdom, in that case how should bodhisattva great beings engage in the meaning of this profound perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་དོན་ཟབ་མོ་འདི་ལ་སྤྱོད་པས། འདི་ལྟར་སྤྱད་པར་བྱ་སྟེ། འདོད་ཆགས་བདག་གི་དོན་ཅེ་འམ། དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings who practice this profound perfection of wisdom should engage in the following manner: They should not engage with the notion that desire is meaningful to them, or that it is meaningless.

source: །ཞེ་སྡང་བདག་གི་དོན་ཅེ་འམ། དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that hatred is meaningful to them, or that it is meaningless.

source: །གཏི་མུག་བདག་གི་དོན་ཅེ་འམ། དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ། །འདོད་ཆགས་དང་། ཞེ་སྡང་དང་།
en: They should not engage with the notion that delusion is meaningful to them, or that it is meaningless.

source: གཏི་མུག་བདག་གི་དོན་ཅེ་འམ། དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that wrong view is meaningful to them, or that it is meaningless.

source: །ལོག་པར་ལྟ་བ་བདག་གི་དོན་ཅེ་འམ། དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ། །ལྟ་བར་གྱུར་པ་ཐམས་ཅད་བདག་གི་དོན་ཅེ་འམ། དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that all that is entailed in wrong views is meaningful to them, or that it is meaningless.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་དེ་བཞིན་ཉིད་ནི་གང་ལ་ཡང་དོན་དུ་མི་བྱེད། དོན་མ་ཡིན་པར་མི་བྱེད་དོ།
en: If you ask why, the real nature of desire, hatred, and delusion does not render anything at all meaningful, and does not render anything at all meaningless. “

source: །ལྟ་བའི་རྣམ་པ་དག་གི་དེ་བཞིན་ཉིད་ནི་གང་ལ་ཡང་དོན་དུ་མི་བྱེད། དོན་མ་ཡིན་པར་མི་བྱེད་དོ། །གཟུགས་བདག་གི་དོན་ཅེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that physical forms are meaningful to them.

source: །གཟུགས་བདག་གི་དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that physical forms are meaningless to them.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་བདག་གི་དོན་ཅེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are meaningful to them.

source: །རྣམ་པར་ཤེས་པ་བདག་གི་དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that consciousness [and so forth] are meaningless to them.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་བདག་གི་དོན་ཅེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that the sense fields, the sensory elements, and the links of dependent origination are meaningful to them.

source: །རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་བདག་གི་དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that the links of dependent origination [and so forth] are meaningless to them.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་བདག་གི་དོན་ཅེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are meaningful to them.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་བདག་གི་དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: They should not engage with the notion that the thirty-seven factors conducive to enlightenment [and so forth] are meaningless to them.

source: མངོན་པར་ཤེས་པ་དང་།
en: Ki.

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་བདག་གི་དོན་ཅེས་སྤྱད་པར་མི་བྱའོ། །གཟུངས་ཀྱི་སྒོ་བདག་གི་དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ།
en: V: 129} They should not engage with the notion that the dhāraṇī gateways [and so forth] are meaningless to them.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་བདག་གི་དོན་ཅེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are meaningful to them.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་བདག་གི་དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that eighteen distinct qualities of the buddhas [and so forth] are meaningless to them.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་བདག་གི་དོན་ཞེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that [the goals], up to and including unsurpassed, complete enlightenment, are meaningful to them.

source: །བླ་ན་མེད་པར་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་བདག་གི་དོན་མ་ཡིན་ཞེས་སྤྱད་པར་མི་བྱའོ།
en: They should not engage with the notion that [the goals], up to and including unsurpassed, complete enlightenment, are meaningless to them.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཆོས་གང་དོན་དུ་བྱ་བ་འམ། དོན་མེད་པར་བྱ་བ་དེ་ལྟ་བུ་གང་ཡང་མ་དམིགས་སོ།
en: If you ask why, Subhūti, it is because after the tathāgatas, arhats, completely awakened buddhas have attained consummate buddhahood in unsurpassed, complete enlightenment, they do not apprehend anything at all that should be rendered meaningful or rendered meaningless. “

source: །རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་རྣམས་སྐྱེས་ཀྱང་རུང་། དེ་བཞིན་གཤེགས་པ་རྣམས་མ་སྐྱེས་ཀྱང་རུང་སྟེ། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དང་། ཆོས་ཀྱི་གནས་ཉིད་ནི་གནས་པ།
en: Moreover, Subhūti, whether the tathāgatas have been born or whether the tathāgatas have not been born, the real nature of phenomena and the abiding nature of phenomena are established.

source: ཆོས་ཀྱི་དབྱིངས་ནི་གནས་པ་སྟེ།
en: The realm of phenomena is established.

source: དེ་ནི་གང་ལ་ཡང་དོན་ཀྱང་མི་བྱེད། དོན་མ་ཡིན་པ་འང་མི་བྱེད་དོ།
en: These do not render anything at all meaningful, nor do they render anything at all meaningless.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དོན་དང་དོན་མ་ཡིན་པ་སྤངས་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ། །གསོལ་པ།
en: So it is, Subhūti, that bodhisattva great beings, having relinquished the meaningful and the meaningless, should practice the perfection of wisdom.” “

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ལ་ཡང་དོན་ཀྱང་མི་བགྱིད། དོན་མ་ལགས་པ་འང་མི་བགྱིད་པ་ལགས།
en: Blessed Lord, why does the perfection of wisdom not render anything at all meaningful? Why does it not render anything at all meaningless?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱི་ཆོས་ཉིད་གང་ཡང་མི་བྱེད་དེ།
en: Subhūti,” replied the Blessed One, “it is because the perfection of wisdom has no effect on conditioned phenomena or on unconditioned reality.

source: དེའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གང་ལ་ཡང་དོན་དུ་བྱེད་པ་ཡང་མ་ཡིན་ནོ། །དོན་མ་ཡིན་པར་བྱེད་པ་ཡང་མ་ཡིན་ནོ། །གསོལ་པ།
en: Therefore, the perfection of wisdom does not render anything at all meaningful, and it does not render anything at all meaningless.” “

source: བཅོམ་ལྡན་འདས་འོ་ན་འདུས་མ་བགྱིས། སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཉན་ཐོས་འཕགས་པ་ཐམས་ཅད་ཀྱི་དོན་མ་ལགས་སམ།
en: Blessed Lord, in that case is the unconditioned [reality] not meaningful for the buddhas and all noble śrāvakas of the buddhas?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འདུས་མ་བྱས་ནི་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཉན་ཐོས་འཕགས་པ་ཐམས་ཅད་ཀྱི་དོན་ཀྱང་ཡིན་ཏེ། ཕན་པ་འམ། གནོད་པར་ཉེ་བར་གནས་པ་མ་ཡིན་ནོ།
en: The unconditioned [reality] is indeed meaningful for the buddhas and all noble śrāvakas of the buddhas, but it is not established for their benefit or harm,” replied the Blessed One. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའི་དེ་བཞིན་ཉིད་ནི་གང་ལ་ཡང་ཕན་པ་འམ། གནོད་པར་ཉེ་བར་གནས་པ་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཆོས་གང་ལ་ཡང་ཕན་པ་འམ། གནོད་པར་ཉེ་བར་གནས་པ་མ་ཡིན་ནོ།
en: Subhūti, just as the real nature of space is not established for the benefit or harm of anything at all, in the same way, Subhūti, the perfection of wisdom that bodhisattva great beings possess is also not established for the benefit or harm of anything at all.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་འོ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདུས་མ་བགྱིས་ཀྱི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་བགྱིད་དམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, do bodhisattva great beings, having trained in the unconditioned perfection of wisdom, not attain all-aspect omniscience?” “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དེ། གཉིས་ཀྱི་ཚུལ་གྱིས་ནི་མ་ཡིན་ནོ། །གསོལ་པ།
en: Having trained in this profound perfection of wisdom, bodhisattva great beings do attain all-aspect omniscience, but not in a dualizing manner.” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། གཉིས་སུ་མ་མཆིས་པའི་ཆོས་ཀྱིས་གཉིས་སུ་མ་མཆིས་པའི་ཆོས་ཐོབ་པར་བགྱིད་དམ།
en: Blessed Lord, is it that something nondual attains something nondual?” “

source: འོ་ན་གཉིས་ཀྱི་ཆོས་ཤིག་གཉིས་ཀྱི་ཆོས་ཐོབ་པར་བགྱིད་པ་ལགས་སམ།
en: In that case, is it that something dualistic attains something dualistic?” {Ki.

source: འོ་ན་ཇི་ལྟར་ཐོབ་པར་འགྱུར།
en: In that case, how will it be attained?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ནམ་གཉིས་ཀྱི་ཆོས་སམ། གཉིས་སུ་མེད་པའི་ཆོས་ཀྱང་མི་དམིགས་པ་ནི། ཐོབ་པར་འགྱུར་རོ།
en: It is attained when dualistic phenomena or nondual phenomena are indeed not apprehended,” replied the Blessed One. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། མི་དམིགས་པ་ནི་ཐོབ་པ་སྟེ།
en: If you ask why, it is because the nonapprehensible is attained.

source: དེ་ནི་དམིགས་པས་ཀྱང་ཐོབ་པར་མི་འགྱུར། མི་དམིགས་པས་ཀྱང་ཐོབ་པར་མི་འགྱུར་རོ།
en: It will neither be attained through apprehending nor will it be attained through nonapprehension.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་ལྔ་བཅུ་གསུམ་པའོ།། །།
en: This completes the fifty-third chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཟབ་བོ།
en: Chapter 54 Then the venerable Subhūti said to the Blessed One, “Blessed Lord, the perfection of wisdom is profound!

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་པ་ཡང་དཀའ་བ་བགྱིད་པ་ལགས་ཏེ།
en: Blessed Lord, bodhisattva great beings who set out for unsurpassed, complete enlightenment indeed achieve that which is difficult.

source: སེམས་ཅན་ཞེས་བགྱི་འམ། སེམས་ཅན་དུ་གདགས་པ་ནི་གང་ཡང་མི་དམིགས་ན། དེ་དག་ནི་སེམས་ཅན་རྣམས་ཀྱི་སླད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་སོ།
en: That is to say, although no ‘being’ or concept of a being is at all apprehended, they have set out toward unsurpassed, complete enlightenment for the sake of beings.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ལ་ལ་ཞིག་ནམ་མཁའ་གཞི་མ་མཆིས་པ་ལ། ལྗང་བུ་བསྐྱེད་པར་འཚལ་བ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་སླད་དུ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འཚལ་ལོ།
en: Blessed Lord, just like some person who seeks to grow a plant in groundless space, bodhisattva great beings indeed seek to attain all-aspect omniscience for the sake of beings.” “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་སེམས་ཅན་རྣམས་ཀྱི་ཕྱིར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་འཇུག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་སེམས་ཅན་དུ་འཛིན་པ་ལས་ཡོངས་སུ་འགྲེལ་པ་ནི། དཀའ་བ་བྱེད་པའོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ།
en: Bodhisattva great beings who set out toward unsurpassed, complete enlightenment for the sake of beings, and, having attained consummate buddhahood in all-aspect omniscience, liberate beings from clinging to sentient existence, achieve that which is difficult.

source: དཔེར་ན་སྐྱེས་བུ་ལ་ལ་ཞིག་ལྗང་བུ་བསྐྱེད་པར་འདོད་ལ། སྐྱེས་བུ་དེས་ལྗང་བུ་དེའི་རྩ་བ་མ་དམིགས། ཡལ་ག་དང་སྡོང་བུ་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་མ་དམིགས་པར་ལྗང་བུ་དེའི་སྡོང་བུ་བསྐྱེད་དེ།
en: Subhūti, it is just as when some persons want to grow a plant, and they would plant the stalk without having perceived the roots of that plant, and without having perceived its branches, trunk, leaves, flowers, or fruit.

source: དུས་དུས་སུ་ཆུས་བྲན་ཅིང་། དེའི་སྡོང་བུ་དེ་རིམ་གྱིས་ཡལ་ག་ཕུན་སུམ་ཚོགས་པར་གྱུར། ལོ་མ་ཕུན་སུམ་ཚོགས་པར་གྱུར། མེ་ཏོག་ཕུན་སུམ་ཚོགས་པར་གྱུར། འབྲས་བུ་ཕུན་སུམ་ཚོགས་པར་གྱུར་པ་དང་། དེ་ལྗང་བུ་དེའི་འདབ་མ་ལ་སྤྱོད་པ་དང་། མེ་ཏོག་ལ་སྤྱོད་པ་དང་། འབྲས་བུ་ལ་སྤྱོད་པ་དེ་བཞིན་དུ།
en: Nurtured with water at the appropriate times, gradually the trunk of that [plant] would become fully formed, its leaves would become fully formed, its flowers would become fully formed, and its fruit would become fully formed, and they would then enjoy the foliage of that plant, they would enjoy its flowers, and they would enjoy its fruit.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱང་། སེམས་ཅན་རྣམས་ཀྱི་ཕྱིར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་འཇུག་སྟེ།
en: In the same way, bodhisattva great beings indeed set out toward unsurpassed, complete enlightenment, for the sake of beings.

source: དེ་དག་རིམ་གྱིས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དེ། དེ་དག་ལ་ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚོ་བར་འགྱུར་རོ།
en: Gradually practicing the six perfections, they will attain all-aspect omniscience, and then they will sustain all beings in the manner of leaves, flowers, and fruit.

source: །རབ་འབྱོར་དེ་ལ་ལོ་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་བརྟེན་ཅིང་། སེམས་ཅན་རྣམས་ངན་སོང་གསུམ་ལས་ཡོངས་སུ་འགྲོལ་བའོ།
en: Relying on bodhisattva great beings who are like leaves, beings will be liberated from the three lower realms.

source: །མེ་ཏོག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་བརྟེན་ཅིང་། རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་དང་། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་དང་། ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བར་སྐྱེ་བ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷར་སྐྱེ་བ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་།
en: Relying on bodhisattva great beings who are like flowers, beings will be reborn in great and lofty royal families, in great and lofty priestly families, or in great and lofty householder families. {

source: དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། ཤིན་དུ་མཐོང་བ་དང་།
en: Ki.

source: གྱ་ནོམ་སྣང་བ་དང་། འོག་མིན་དང་། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་ཆུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལྷར་སྐྱེ་བའོ།
en: V: 131} They will be reborn among the gods of the Caturmahā­rāja­kāyika realm, and they will be reborn among the gods of Trayastriṃśa, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahma­pariṣadya, Brahmapurohita, Mahābrahmā Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, Akaniṣṭha, the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception.

source: །འབྲས་བུ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་ནས། སེམས་ཅན་དེ་དག་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་རབ་ཏུ་འགོད་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་རབ་ཏུ་འགོད་པ་དང་།
en: Like fruit, bodhisattva great beings, having attained all-aspect omniscience, then establish those beings in the fruit of entering the stream to nirvāṇa, and establish them in the fruit of being destined for only one more rebirth, in the fruit of no longer being subject to rebirth, in arhatship, and in individual enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཉིད་ལ་བརྟེན་ཅིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་ནས། དེ་དག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་འབྲས་བུ་ལ་ཉེ་བར་འཚོ་བ་བཞིན་ཉེ་བར་འཚོ་བར་འགྱུར་བ་དང་། དེ་ལ་གང་གིས་ཡོན་ཕུལ་བ་དེ་དག་གིས་ཀྱང་རིམ་གྱིས། འདི་ལྟ་སྟེ།
en: Relying on those same bodhisattva great beings, they will attain all-aspect omniscience, and having attained all-aspect omniscience, they too will sustain all beings, just as fruit is sustaining.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་འམ། ཐེག་པ་ཆེན་པོ་འམ། ཐེག་པ་གསུམ་པོ་དེ་དག་གིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཡང་།
en: Those who offer them donations will also gradually attain final nirvāṇa through the three vehicles, namely, the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the Great Vehicle, and they will attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: དེ་ལ་སེམས་ཅན་དུ་ཡང་མི་འདོགས། སེམས་ཅན་དུ་གདགས་པ་ཡང་མེད་པར་སེམས་ཅན་དེ་དག་ཀྱང་སེམས་ཅན་དུ་འཛིན་པ་ལས་ཡོངས་སུ་འགྲེལ་པ་སྟེ།
en: Although they do not conceive of a being and there is nothing even to conceive of as a being, they will nevertheless liberate beings from clinging to being.

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱང་། གང་གི་དོན་དུ་བདག་གིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱའོ། །ཞེས་བྱ་བའི་སེམས་ཅན་ནམ། སེམས་ཅན་དུ་གདགས་པ་གང་ཡང་མི་དམིགས་སོ།
en: Subhūti, although bodhisattva great beings practice the perfection of wisdom in that manner, they do not apprehend any being at all, or any concept of a being, of whom they would think, ‘I should attain all-aspect omniscience for their sake!’ ”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དེ་བཞིན་གཤེགས་པ་ཉིད་དུ་རིག་པར་བགྱིའོ།
en: Subhūti then said, “Blessed Lord, bodhisattva great beings should be known to resemble the Tathāgata himself.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་བརྟེན་ན། སེམས་ཅན་དམྱལ་བ་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར་རོ།
en: If one were to ask why, Blessed Lord, it is because in relying on bodhisattva great beings all the hells will be cut off.

source: །བྱོལ་སོང་གི་སྐྱེ་གནས་ཐམས་ཅད་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་ཐམས་ཅད་རྒྱུན་འཆད་པར་འགྱུར་རོ།
en: All the animal realms and all the worlds of Yama will be cut off.

source: །མི་ཁོམ་པ་དང་། ངན་སོང་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར་རོ།
en: The [eight] unfavorable states with no opportunity [to practice the Dharma] and all lower realms will be cut off.

source: །དབུལ་པོ་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར་རོ།
en: All poverty will be cut off.

source: །ལམ་གྱི་རྒྱུད་དམའ་བ་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར་རོ།
en: All inferior destinies will be cut off.

source: །འདོད་པའི་ཁམས་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར་རོ།
en: The entire realm of desire will be cut off.
